; domain
;; =====================================================================
;; Domena: Multi-modalny transport paczek (wersja STRIPS)
;; Rozszerzenia: :strips, :typing, :negative-preconditions
;; -- bez funkcji numerycznych, koszt = dlugosc planu (liczba akcji)
;; =====================================================================
(define (domain transport-strips)

  (:requirements :strips :typing :negative-preconditions)

  (:types
    package vehicle location - object
    truck plane ship - vehicle
  )

  (:predicates
    (at-pkg ?p - package ?l - location)
    (at-veh ?v - vehicle ?l - location)
    (in    ?p - package ?v - vehicle)
    (road-connected  ?l1 - location ?l2 - location)
    (air-connected   ?l1 - location ?l2 - location)
    (water-connected ?l1 - location ?l2 - location)
  )

  (:action load
    :parameters (?p - package ?v - vehicle ?l - location)
    :precondition (and (at-pkg ?p ?l) (at-veh ?v ?l))
    :effect (and (not (at-pkg ?p ?l)) (in ?p ?v))
  )

  (:action unload
    :parameters (?p - package ?v - vehicle ?l - location)
    :precondition (and (in ?p ?v) (at-veh ?v ?l))
    :effect (and (at-pkg ?p ?l) (not (in ?p ?v)))
  )

  (:action drive
    :parameters (?t - truck ?from - location ?to - location)
    :precondition (and (at-veh ?t ?from) (road-connected ?from ?to))
    :effect (and (not (at-veh ?t ?from)) (at-veh ?t ?to))
  )

  (:action fly
    :parameters (?pl - plane ?from - location ?to - location)
    :precondition (and (at-veh ?pl ?from) (air-connected ?from ?to))
    :effect (and (not (at-veh ?pl ?from)) (at-veh ?pl ?to))
  )

  (:action sail
    :parameters (?s - ship ?from - location ?to - location)
    :precondition (and (at-veh ?s ?from) (water-connected ?from ?to))
    :effect (and (not (at-veh ?s ?from)) (at-veh ?s ?to))
  )
)

; problem
;; =====================================================================
;; Problem: 3 paczki, transport multi-modalny (wersja STRIPS)
;;
;; Topologia:
;;
;;     warehouse --(road)-- portA ==(water)== portB --(road)-- shop
;;          |                                                     |
;;          \--(road)-- airportA --(air)-- airportB --(road)-----/
;;
;; Cel: pkg1, pkg2 (z warehouse) i pkg3 (z portA) maja trafic do shop.
;; =====================================================================
(define (problem transport-3pkg-strips)
  (:domain transport-strips)

  (:objects
    pkg1 pkg2 pkg3                  - package
    warehouse portA portB shop
    airportA airportB               - location
    truck1 truck2 truck3 truck4     - truck
    plane1                          - plane
    ship1                           - ship
  )

  (:init
    (at-pkg pkg1 warehouse)
    (at-pkg pkg2 warehouse)
    (at-pkg pkg3 portA)

    (at-veh truck1 warehouse)
    (at-veh truck2 portB)
    (at-veh truck3 airportB)
    (at-veh truck4 shop)
    (at-veh ship1  portA)
    (at-veh plane1 airportA)

    ;; drogi -- dwukierunkowe
    (road-connected warehouse portA)    (road-connected portA warehouse)
    (road-connected warehouse airportA) (road-connected airportA warehouse)
    (road-connected portB shop)         (road-connected shop portB)
    (road-connected airportB shop)      (road-connected shop airportB)

    ;; trasa morska
    (water-connected portA portB)       (water-connected portB portA)

    ;; trasa lotnicza
    (air-connected airportA airportB)   (air-connected airportB airportA)
  )

  (:goal (and
    (at-pkg pkg1 shop)
    (at-pkg pkg2 shop)
    (at-pkg pkg3 shop)
  ))
)

; plan
1. (load pkg2 truck1 warehouse)
   deleted: (at-pkg pkg2 warehouse)
   added: (in pkg2 truck1)
   goals met: 0 of 3
2. (load pkg1 truck1 warehouse)
   deleted: (at-pkg pkg1 warehouse)
   added: (in pkg1 truck1)
   goals met: 0 of 3
3. (drive truck1 warehouse porta)
   deleted: (at-veh truck1 warehouse)
   added: (at-veh truck1 porta)
   goals met: 0 of 3
4. (unload pkg2 truck1 porta)
   deleted: (in pkg2 truck1)
   added: (at-pkg pkg2 porta)
   goals met: 0 of 3
5. (unload pkg1 truck1 porta)
   deleted: (in pkg1 truck1)
   added: (at-pkg pkg1 porta)
   goals met: 0 of 3
6. (load pkg2 ship1 porta)
   deleted: (at-pkg pkg2 porta)
   added: (in pkg2 ship1)
   goals met: 0 of 3
7. (load pkg1 ship1 porta)
   deleted: (at-pkg pkg1 porta)
   added: (in pkg1 ship1)
   goals met: 0 of 3
8. (load pkg3 ship1 porta)
   deleted: (at-pkg pkg3 porta)
   added: (in pkg3 ship1)
   goals met: 0 of 3
9. (sail ship1 porta portb)
   deleted: (at-veh ship1 porta)
   added: (at-veh ship1 portb)
   goals met: 0 of 3
10. (unload pkg2 ship1 portb)
   deleted: (in pkg2 ship1)
   added: (at-pkg pkg2 portb)
   goals met: 0 of 3
11. (unload pkg1 ship1 portb)
   deleted: (in pkg1 ship1)
   added: (at-pkg pkg1 portb)
   goals met: 0 of 3
12. (unload pkg3 ship1 portb)
   deleted: (in pkg3 ship1)
   added: (at-pkg pkg3 portb)
   goals met: 0 of 3
13. (load pkg2 truck2 portb)
   deleted: (at-pkg pkg2 portb)
   added: (in pkg2 truck2)
   goals met: 0 of 3
14. (load pkg1 truck2 portb)
   deleted: (at-pkg pkg1 portb)
   added: (in pkg1 truck2)
   goals met: 0 of 3
15. (load pkg3 truck2 portb)
   deleted: (at-pkg pkg3 portb)
   added: (in pkg3 truck2)
   goals met: 0 of 3
16. (drive truck2 portb shop)
   deleted: (at-veh truck2 portb)
   added: (at-veh truck2 shop)
   goals met: 0 of 3
17. (unload pkg2 truck2 shop)
   deleted: (in pkg2 truck2)
   added: (at-pkg pkg2 shop)
   goals met: 1 of 3
18. (unload pkg1 truck2 shop)
   deleted: (in pkg1 truck2)
   added: (at-pkg pkg1 shop)
   goals met: 2 of 3
19. (unload pkg3 truck2 shop)
   deleted: (in pkg3 truck2)
   added: (at-pkg pkg3 shop)
   goals met: 3 of 3
